kiffie/pic32-pac/pic32mx2xx/pic32mx1x4fxxxd/PIC32MX174F256D.svd
        <register>
          <name>AD1CSSLINV</name>
          <description>AD1CSSLINV register</description>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>CSSL0</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CSSL1</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CSSL2</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CSSL3</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CSSL4</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CSSL5</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CSSL6</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CSSL7</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CSSL8</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CSSL9</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CSSL10</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CSSL11</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CSSL12</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CSSL13</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CSSL14</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CSSL15</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CSSL17</name>
              <bitRange>[17:17]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF0</name>
          <description>ADC1BUF0 register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF0</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF1</name>
          <description>ADC1BUF1 register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF1</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF2</name>
          <description>ADC1BUF2 register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF2</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF3</name>
          <description>ADC1BUF3 register</description>
          <addressOffset>0xa0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF3</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF4</name>
          <description>ADC1BUF4 register</description>
          <addressOffset>0xb0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF4</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF5</name>
          <description>ADC1BUF5 register</description>
          <addressOffset>0xc0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF5</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF6</name>
          <description>ADC1BUF6 register</description>
          <addressOffset>0xd0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF6</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF7</name>
          <description>ADC1BUF7 register</description>
          <addressOffset>0xe0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF7</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF8</name>
          <description>ADC1BUF8 register</description>
          <addressOffset>0xf0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF8</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUF9</name>
          <description>ADC1BUF9 register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUF9</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFA</name>
          <description>ADC1BUFA register</description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFA</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFB</name>
          <description>ADC1BUFB register</description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFB</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFC</name>
          <description>ADC1BUFC register</description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFC</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFD</name>
          <description>ADC1BUFD register</description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFD</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFE</name>
          <description>ADC1BUFE register</description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFE</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC1BUFF</name>
          <description>ADC1BUFF register</description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ADC1BUFF</name>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
