kiffie/pic32-pac/pic32mx2xx/pic32mx1x4fxxxd/PIC32MX174F256D.svd
        <register>
          <name>RNMICONCLR</name>
          <description>RNMICONCLR register</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NMICNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>WDTS</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HLVD</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>GNMI</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SWNMI</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNMICONSET</name>
          <description>RNMICONSET register</description>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NMICNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>WDTS</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HLVD</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>GNMI</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SWNMI</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RNMICONINV</name>
          <description>RNMICONINV register</description>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>NMICNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>WDTS</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CF</name>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>HLVD</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>GNMI</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>SWNMI</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>WDTO</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCON</name>
          <description>PWRCON register</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VREGS</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCONCLR</name>
          <description>PWRCONCLR register</description>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VREGS</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCONSET</name>
          <description>PWRCONSET register</description>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VREGS</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PWRCONINV</name>
          <description>PWRCONINV register</description>
          <addressOffset>0x7c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>VREGS</name>
              <bitRange>[0:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1CON</name>
          <description>REFO1CON register</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1CONCLR</name>
          <description>REFO1CONCLR register</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1CONSET</name>
          <description>REFO1CONSET register</description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1CONINV</name>
          <description>REFO1CONINV register</description>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROSEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ACTIVE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>DIVSWEN</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>RSLP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SIDL</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>RODIV</name>
              <bitRange>[30:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1TRIM</name>
          <description>REFO1TRIM register</description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1TRIMCLR</name>
          <description>REFO1TRIMCLR register</description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1TRIMSET</name>
          <description>REFO1TRIMSET register</description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>REFO1TRIMINV</name>
          <description>REFO1TRIMINV register</description>
          <addressOffset>0x9c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>ROTRIM</name>
              <bitRange>[31:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB1DIV</name>
          <description>PB1DIV register</description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <resetValue>34816</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB1DIVCLR</name>
          <description>PB1DIVCLR register</description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB1DIVSET</name>
          <description>PB1DIVSET register</description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PB1DIVINV</name>
          <description>PB1DIVINV register</description>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>PBDIV</name>
              <bitRange>[6:0]</bitRange>
            </field>
            <field>
              <name>PBDIVRDY</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ON</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTAT</name>
          <description>CLKSTAT register</description>
          <addressOffset>0x1d0</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRCRDY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPDIVRDY</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>POSCRDY</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LPRCRDY</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPLLRDY</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UPLLRDY</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTATCLR</name>
          <description>CLKSTATCLR register</description>
          <addressOffset>0x1d4</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRCRDY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPDIVRDY</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>POSCRDY</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LPRCRDY</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPLLRDY</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UPLLRDY</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTATSET</name>
          <description>CLKSTATSET register</description>
          <addressOffset>0x1d8</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRCRDY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPDIVRDY</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>POSCRDY</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LPRCRDY</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPLLRDY</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UPLLRDY</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKSTATINV</name>
          <description>CLKSTATINV register</description>
          <addressOffset>0x1dc</addressOffset>
          <size>32</size>
          <resetValue>0</resetValue>
          <fields>
            <field>
              <name>FRCRDY</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SPDIVRDY</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>POSCRDY</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>SOSCRDY</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>LPRCRDY</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SPLLRDY</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UPLLRDY</name>
              <bitRange>[8:8]</bitRange>
            </field>
          </fields>
        </register>
